{
  "99,99": 256,
  "67,67": 257,
  "99,49": 258,
  "40,67": 259,
  "99,50": 260,
  "70,41": 261,
  "91,67": 262,
  "262,64": 263,
  "72,93": 264,
  "99,40": 265,
  "79,41": 266,
  "99,51": 267,
  "61,266": 268,
  "258,256": 269,
  "40,261": 270,
  "40,268": 271,
  "49,67": 272,
  "99,110": 273,
  "263,64": 274,
  "260,256": 275,
  "259,41": 276,
  "41,256": 277,
  "263,264": 278,
  "274,264": 279,
  "99,259": 280,
  "40,78": 281,
  "51,41": 282,
  "257,67": 283,
  "267,256": 284,
  "50,41": 285,
  "49,257": 286,
  "79,67": 287,
  "99,52": 288,
  "78,67": 289,
  "265,261": 290,
  "110,256": 291,
  "79,257": 292,
  "270,270": 293,
  "50,67": 294,
  "265,45": 295,
  "41,110": 296,
  "50,257": 297,
  "40,45": 298,
  "41,67": 299,
  "40,257": 300,
  "280,108": 301,
  "40,266": 302,
  "271,78": 303,
  "293,261": 304,
  "91,110": 305,
  "41,257": 306,
  "305,264": 307,
  "258,67": 308,
  "260,110": 309,
  "61,67": 310,
  "276,67": 311,
  "79,269": 312,
  "265,78": 313,
  "288,256": 314,
  "290,256": 315,
  "275,256": 316,
  "281,67": 317,
  "51,257": 318,
  "284,256": 319,
  "269,256": 320,
  "78,40": 321,
  "99,53": 322,
  "52,41": 323,
  "49,41": 324,
  "258,41": 325,
  "271,67": 326,
  "110,49": 327,
  "257,292": 328,
  "259,304": 329,
  "258,110": 330,
  "258,291": 331,
  "78,259": 332,
  "51,67": 333,
  "267,110": 334,
  "301,277": 335,
  "274,93": 336,
  "260,41": 337,
  "258,273": 338,
  "301,41": 339,
  "272,78": 340,
  "110,50": 341,
  "79,310": 342,
  "263,93": 343,
  "35,78": 344,
  "260,282": 345,
  "52,277": 346,
  "279,40": 347,
  "260,265": 348,
  "78,286": 349,
  "108,41": 350,
  "285,67": 351,
  "40,269": 352,
  "281,41": 353,
  "285,110": 354,
  "50,283": 355,
  "282,67": 356,
  "50,277": 357,
  "319,267": 358,
  "285,257": 359,
  "316,260": 360,
  "51,277": 361,
  "279,272": 362,
  "282,257": 363,
  "309,273": 364,
  "275,265": 365,
  "52,283": 366,
  "61,78": 367,
  "110,272": 368,
  "281,52": 369,
  "260,291": 370,
  "70,67": 371,
  "49,283": 372,
  "272,79": 373,
  "369,328": 374,
  "289,271": 375,
  "83,271": 376,
  "364,284": 377,
  "322,256": 378,
  "270,261": 379,
  "377,374": 380,
  "282,110": 381,
  "78,272": 382,
  "298,275": 383,
  "265,287": 384,
  "40,275": 385,
  "273,314": 386,
  "265,268": 387,
  "324,269": 388,
  "380,346": 389,
  "283,261": 390,
  "99,276": 391,
  "276,257": 392,
  "49,78": 393,
  "329,256": 394,
  "99,54": 395,
  "52,296": 396,
  "317,271": 397,
  "275,280": 398,
  "281,53": 399,
  "260,67": 400,
  "259,78": 401,
  "302,67": 402,
  "304,256": 403,
  "267,323": 404,
  "289,326": 405,
  "41,300": 406,
  "279,49": 407,
  "279,276": 408,
  "259,303": 409,
  "278,281": 410,
  "53,277": 411,
  "40,287": 412,
  "110,51": 413,
  "78,257": 414,
  "272,312": 415,
  "260,273": 416,
  "314,256": 417,
  "51,366": 418,
  "54,406": 419,
  "341,256": 420,
  "389,345": 421,
  "258,257": 422,
  "99,115": 423,
  "270,256": 424,
  "286,276": 425,
  "260,296": 426,
  "40,284": 427,
  "290,295": 428,
  "269,295": 429,
  "52,257": 430,
  "271,266": 431,
  "49,299": 432,
  "280,302": 433,
  "334,386": 434,
  "399,328": 435,
  "49,287": 436,
  "278,294": 437,
  "279,294": 438,
  "260,261": 439,
  "265,110": 440,
  "434,435": 441,
  "298,284": 442,
  "259,350": 443,
  "278,297": 444,
  "49,342": 445,
  "441,411": 446,
  "51,283": 447,
  "317,326": 448,
  "336,50": 449,
  "267,273": 450,
  "267,307": 451,
  "269,265": 452,
  "446,404": 453,
  "344,41": 454,
  "292,78": 455,
  "332,271": 456,
  "349,293": 457,
  "353,367": 458,
  "320,258": 459,
  "344,277": 460,
  "433,275": 461,
  "47,67": 462,
  "271,289": 463,
  "269,280": 464,
  "339,339": 465,
  "110,267": 466,
  "256,50": 467,
  "290,273": 468,
  "362,348": 469,
  "311,41": 470,
  "405,79": 471,
  "288,110": 472,
  "303,286": 473,
  "267,291": 474,
  "108,296": 475,
  "35,67": 476,
  "273,267": 477,
  "53,41": 478,
  "337,273": 479,
  "52,306": 480,
  "256,258": 481,
  "269,259": 482,
  "368,338": 483,
  "271,268": 484,
  "260,307": 485,
  "331,483": 486,
  "278,49": 487,
  "279,50": 488,
  "256,294": 489,
  "99,55": 490,
  "278,259": 491,
  "295,284": 492,
  "313,296": 493,
  "108,277": 494,
  "278,40": 495,
  "282,287": 496,
  "278,333": 497,
  "256,49": 498,
  "278,286": 499,
  "53,306": 500,
  "79,61": 501,
  "417,288": 502,
  "343,49": 503,
  "353,268": 504,
  "260,306": 505,
  "486,383": 506,
  "78,300": 507,
  "396,260": 508,
  "376,271": 509,
  "278,272": 510,
  "455,390": 511
}