{
  "vocab": {
    "0": "\u0000",
    "1": "\u0001",
    "2": "\u0002",
    "3": "\u0003",
    "4": "\u0004",
    "5": "\u0005",
    "6": "\u0006",
    "7": "\u0007",
    "8": "\b",
    "9": "\t",
    "10": "\n",
    "11": "\u000b",
    "12": "\f",
    "13": "\r",
    "14": "\u000e",
    "15": "\u000f",
    "16": "\u0010",
    "17": "\u0011",
    "18": "\u0012",
    "19": "\u0013",
    "20": "\u0014",
    "21": "\u0015",
    "22": "\u0016",
    "23": "\u0017",
    "24": "\u0018",
    "25": "\u0019",
    "26": "\u001a",
    "27": "\u001b",
    "28": "\u001c",
    "29": "\u001d",
    "30": "\u001e",
    "31": "\u001f",
    "32": " ",
    "33": "!",
    "34": "\"",
    "35": "#",
    "36": "$",
    "37": "%",
    "38": "&",
    "39": "'",
    "40": "(",
    "41": ")",
    "42": "*",
    "43": "+",
    "44": ",",
    "45": "-",
    "46": ".",
    "47": "/",
    "48": "0",
    "49": "1",
    "50": "2",
    "51": "3",
    "52": "4",
    "53": "5",
    "54": "6",
    "55": "7",
    "56": "8",
    "57": "9",
    "58": ":",
    "59": ";",
    "60": "<",
    "61": "=",
    "62": ">",
    "63": "?",
    "64": "@",
    "65": "A",
    "66": "B",
    "67": "C",
    "68": "D",
    "69": "E",
    "70": "F",
    "71": "G",
    "72": "H",
    "73": "I",
    "74": "J",
    "75": "K",
    "76": "L",
    "77": "M",
    "78": "N",
    "79": "O",
    "80": "P",
    "81": "Q",
    "82": "R",
    "83": "S",
    "84": "T",
    "85": "U",
    "86": "V",
    "87": "W",
    "88": "X",
    "89": "Y",
    "90": "Z",
    "91": "[",
    "92": "\\",
    "93": "]",
    "94": "^",
    "95": "_",
    "96": "`",
    "97": "a",
    "98": "b",
    "99": "c",
    "100": "d",
    "101": "e",
    "102": "f",
    "103": "g",
    "104": "h",
    "105": "i",
    "106": "j",
    "107": "k",
    "108": "l",
    "109": "m",
    "110": "n",
    "111": "o",
    "112": "p",
    "113": "q",
    "114": "r",
    "115": "s",
    "116": "t",
    "117": "u",
    "118": "v",
    "119": "w",
    "120": "x",
    "121": "y",
    "122": "z",
    "123": "{",
    "124": "|",
    "125": "}",
    "126": "~",
    "127": "\u007f",
    "128": "80",
    "129": "81",
    "130": "82",
    "131": "83",
    "132": "84",
    "133": "85",
    "134": "86",
    "135": "87",
    "136": "88",
    "137": "89",
    "138": "8a",
    "139": "8b",
    "140": "8c",
    "141": "8d",
    "142": "8e",
    "143": "8f",
    "144": "90",
    "145": "91",
    "146": "92",
    "147": "93",
    "148": "94",
    "149": "95",
    "150": "96",
    "151": "97",
    "152": "98",
    "153": "99",
    "154": "9a",
    "155": "9b",
    "156": "9c",
    "157": "9d",
    "158": "9e",
    "159": "9f",
    "160": "a0",
    "161": "a1",
    "162": "a2",
    "163": "a3",
    "164": "a4",
    "165": "a5",
    "166": "a6",
    "167": "a7",
    "168": "a8",
    "169": "a9",
    "170": "aa",
    "171": "ab",
    "172": "ac",
    "173": "ad",
    "174": "ae",
    "175": "af",
    "176": "b0",
    "177": "b1",
    "178": "b2",
    "179": "b3",
    "180": "b4",
    "181": "b5",
    "182": "b6",
    "183": "b7",
    "184": "b8",
    "185": "b9",
    "186": "ba",
    "187": "bb",
    "188": "bc",
    "189": "bd",
    "190": "be",
    "191": "bf",
    "192": "c0",
    "193": "c1",
    "194": "c2",
    "195": "c3",
    "196": "c4",
    "197": "c5",
    "198": "c6",
    "199": "c7",
    "200": "c8",
    "201": "c9",
    "202": "ca",
    "203": "cb",
    "204": "cc",
    "205": "cd",
    "206": "ce",
    "207": "cf",
    "208": "d0",
    "209": "d1",
    "210": "d2",
    "211": "d3",
    "212": "d4",
    "213": "d5",
    "214": "d6",
    "215": "d7",
    "216": "d8",
    "217": "d9",
    "218": "da",
    "219": "db",
    "220": "dc",
    "221": "dd",
    "222": "de",
    "223": "df",
    "224": "e0",
    "225": "e1",
    "226": "e2",
    "227": "e3",
    "228": "e4",
    "229": "e5",
    "230": "e6",
    "231": "e7",
    "232": "e8",
    "233": "e9",
    "234": "ea",
    "235": "eb",
    "236": "ec",
    "237": "ed",
    "238": "ee",
    "239": "ef",
    "240": "f0",
    "241": "f1",
    "242": "f2",
    "243": "f3",
    "244": "f4",
    "245": "f5",
    "246": "f6",
    "247": "f7",
    "248": "f8",
    "249": "f9",
    "250": "fa",
    "251": "fb",
    "252": "fc",
    "253": "fd",
    "254": "fe",
    "255": "ff",
    "256": "cc",
    "257": "CC",
    "258": "c1",
    "259": "(C",
    "260": "c2",
    "261": "F)",
    "262": "[C",
    "263": "[C@",
    "264": "H]",
    "265": "c(",
    "266": "O)",
    "267": "c3",
    "268": "=O)",
    "269": "c1cc",
    "270": "(F)",
    "271": "(=O)",
    "272": "1C",
    "273": "cn",
    "274": "[C@@",
    "275": "c2cc",
    "276": "(C)",
    "277": ")cc",
    "278": "[C@H]",
    "279": "[C@@H]",
    "280": "c(C",
    "281": "(N",
    "282": "3)",
    "283": "CCC",
    "284": "c3cc",
    "285": "2)",
    "286": "1CC",
    "287": "OC",
    "288": "c4",
    "289": "NC",
    "290": "c(F)",
    "291": "ncc",
    "292": "OCC",
    "293": "(F)(F)",
    "294": "2C",
    "295": "c(-",
    "296": ")n",
    "297": "2CC",
    "298": "(-",
    "299": ")C",
    "300": "(CC",
    "301": "c(Cl",
    "302": "(O)",
    "303": "(=O)N",
    "304": "(F)(F)F)",
    "305": "[n",
    "306": ")CC",
    "307": "[nH]",
    "308": "c1C",
    "309": "c2n",
    "310": "=C",
    "311": "(C)C",
    "312": "Oc1cc",
    "313": "c(N",
    "314": "c4cc",
    "315": "c(F)cc",
    "316": "c2cccc",
    "317": "(NC",
    "318": "3CC",
    "319": "c3cccc",
    "320": "c1cccc",
    "321": "N(",
    "322": "c5",
    "323": "4)",
    "324": "1)",
    "325": "c1)",
    "326": "(=O)C",
    "327": "n1",
    "328": "CCOCC",
    "329": "(C(F)(F)F)",
    "330": "c1n",
    "331": "c1ncc",
    "332": "N(C",
    "333": "3C",
    "334": "c3n",
    "335": "c(Cl)cc",
    "336": "[C@@]",
    "337": "c2)",
    "338": "c1cn",
    "339": "c(Cl)",
    "340": "1CN",
    "341": "n2",
    "342": "O=C",
    "343": "[C@]",
    "344": "#N",
    "345": "c23)",
    "346": "4)cc",
    "347": "[C@@H](",
    "348": "c2c(",
    "349": "N1CC",
    "350": "l)",
    "351": "2)C",
    "352": "(c1cc",
    "353": "(N)",
    "354": "2)n",
    "355": "2CCC",
    "356": "3)C",
    "357": "2)cc",
    "358": "c3ccccc3",
    "359": "2)CC",
    "360": "c2ccccc2",
    "361": "3)cc",
    "362": "[C@@H]1C",
    "363": "3)CC",
    "364": "c2ncn",
    "365": "c2ccc(",
    "366": "4CCC",
    "367": "=N",
    "368": "n1C",
    "369": "(N4",
    "370": "c2ncc",
    "371": "FC",
    "372": "1CCC",
    "373": "1CO",
    "374": "(N4CCOCC",
    "375": "NC(=O)",
    "376": "S(=O)",
    "377": "c2ncnc3cc",
    "378": "c5cc",
    "379": "(F)F)",
    "380": "c2ncnc3cc(N4CCOCC",
    "381": "3)n",
    "382": "N1C",
    "383": "(-c2cc",
    "384": "c(OC",
    "385": "(c2cc",
    "386": "cnc4cc",
    "387": "c(=O)",
    "388": "1)c1cc",
    "389": "c2ncnc3cc(N4CCOCC4)cc",
    "390": "CCCF)",
    "391": "c(C)",
    "392": "(C)CC",
    "393": "1N",
    "394": "(C(F)(F)F)cc",
    "395": "c6",
    "396": "4)n",
    "397": "(NC(=O)",
    "398": "c2ccc(C",
    "399": "(N5",
    "400": "c2C",
    "401": "(CN",
    "402": "(O)C",
    "403": "(F)(F)F)cc",
    "404": "c34)",
    "405": "NC(=O)C",
    "406": ")(CC",
    "407": "[C@@H]1",
    "408": "[C@@H](C)",
    "409": "(C(=O)N",
    "410": "[C@H](N",
    "411": "5)cc",
    "412": "(OC",
    "413": "n3",
    "414": "NCC",
    "415": "1COc1cc",
    "416": "c2cn",
    "417": "c4cccc",
    "418": "34CCC",
    "419": "6)(CC",
    "420": "n2cc",
    "421": "c2ncnc3cc(N4CCOCC4)ccc23)",
    "422": "c1CC",
    "423": "cs",
    "424": "(F)cc",
    "425": "1CC(C)",
    "426": "c2)n",
    "427": "(c3cc",
    "428": "c(F)c(-",
    "429": "c1ccc(-",
    "430": "4CC",
    "431": "(=O)O)",
    "432": "1)C",
    "433": "c(C(O)",
    "434": "c3ncnc4cc",
    "435": "(N5CCOCC",
    "436": "1OC",
    "437": "[C@H]2C",
    "438": "[C@@H]2C",
    "439": "c2F)",
    "440": "c(n",
    "441": "c3ncnc4cc(N5CCOCC",
    "442": "(-c3cc",
    "443": "(Cl)",
    "444": "[C@H]2CC",
    "445": "1O=C",
    "446": "c3ncnc4cc(N5CCOCC5)cc",
    "447": "3CCC",
    "448": "(NC(=O)C",
    "449": "[C@@]2",
    "450": "c3cn",
    "451": "c3[nH]",
    "452": "c1ccc(",
    "453": "c3ncnc4cc(N5CCOCC5)ccc34)",
    "454": "#N)",
    "455": "OCCN",
    "456": "N(C(=O)",
    "457": "N1CC(F)(F)",
    "458": "(N)=N",
    "459": "c1ccccc1",
    "460": "#N)cc",
    "461": "c(C(O)c2cc",
    "462": "/C",
    "463": "(=O)NC",
    "464": "c1ccc(C",
    "465": "c(Cl)c(Cl)",
    "466": "nc3",
    "467": "cc2",
    "468": "c(F)cn",
    "469": "[C@@H]1Cc2c(",
    "470": "(C)C)",
    "471": "NC(=O)CO",
    "472": "c4n",
    "473": "(=O)N1CC",
    "474": "c3ncc",
    "475": "l)n",
    "476": "#C",
    "477": "cnc3",
    "478": "5)",
    "479": "c2)cn",
    "480": "4)CC",
    "481": "ccc1",
    "482": "c1cc(C",
    "483": "n1Cc1cn",
    "484": "(=O)=O)",
    "485": "c2[nH]",
    "486": "c1nccn1Cc1cn",
    "487": "[C@H]1",
    "488": "[C@@H]2",
    "489": "cc2C",
    "490": "c7",
    "491": "[C@H](C",
    "492": "c(-c3cc",
    "493": "c(N)n",
    "494": "l)cc",
    "495": "[C@H](",
    "496": "3)OC",
    "497": "[C@H]3C",
    "498": "cc1",
    "499": "[C@H]1CC",
    "500": "5)CC",
    "501": "O=",
    "502": "c4ccccc4",
    "503": "[C@]1",
    "504": "(N)=O)",
    "505": "c2)CC",
    "506": "c1nccn1Cc1cn(-c2cc",
    "507": "N(CC",
    "508": "4)nc2",
    "509": "S(=O)(=O)",
    "510": "[C@H]1C",
    "511": "OCCNCCCF)"
  },
  "merges": {
    "99,99": 256,
    "67,67": 257,
    "99,49": 258,
    "40,67": 259,
    "99,50": 260,
    "70,41": 261,
    "91,67": 262,
    "262,64": 263,
    "72,93": 264,
    "99,40": 265,
    "79,41": 266,
    "99,51": 267,
    "61,266": 268,
    "258,256": 269,
    "40,261": 270,
    "40,268": 271,
    "49,67": 272,
    "99,110": 273,
    "263,64": 274,
    "260,256": 275,
    "259,41": 276,
    "41,256": 277,
    "263,264": 278,
    "274,264": 279,
    "99,259": 280,
    "40,78": 281,
    "51,41": 282,
    "257,67": 283,
    "267,256": 284,
    "50,41": 285,
    "49,257": 286,
    "79,67": 287,
    "99,52": 288,
    "78,67": 289,
    "265,261": 290,
    "110,256": 291,
    "79,257": 292,
    "270,270": 293,
    "50,67": 294,
    "265,45": 295,
    "41,110": 296,
    "50,257": 297,
    "40,45": 298,
    "41,67": 299,
    "40,257": 300,
    "280,108": 301,
    "40,266": 302,
    "271,78": 303,
    "293,261": 304,
    "91,110": 305,
    "41,257": 306,
    "305,264": 307,
    "258,67": 308,
    "260,110": 309,
    "61,67": 310,
    "276,67": 311,
    "79,269": 312,
    "265,78": 313,
    "288,256": 314,
    "290,256": 315,
    "275,256": 316,
    "281,67": 317,
    "51,257": 318,
    "284,256": 319,
    "269,256": 320,
    "78,40": 321,
    "99,53": 322,
    "52,41": 323,
    "49,41": 324,
    "258,41": 325,
    "271,67": 326,
    "110,49": 327,
    "257,292": 328,
    "259,304": 329,
    "258,110": 330,
    "258,291": 331,
    "78,259": 332,
    "51,67": 333,
    "267,110": 334,
    "301,277": 335,
    "274,93": 336,
    "260,41": 337,
    "258,273": 338,
    "301,41": 339,
    "272,78": 340,
    "110,50": 341,
    "79,310": 342,
    "263,93": 343,
    "35,78": 344,
    "260,282": 345,
    "52,277": 346,
    "279,40": 347,
    "260,265": 348,
    "78,286": 349,
    "108,41": 350,
    "285,67": 351,
    "40,269": 352,
    "281,41": 353,
    "285,110": 354,
    "50,283": 355,
    "282,67": 356,
    "50,277": 357,
    "319,267": 358,
    "285,257": 359,
    "316,260": 360,
    "51,277": 361,
    "279,272": 362,
    "282,257": 363,
    "309,273": 364,
    "275,265": 365,
    "52,283": 366,
    "61,78": 367,
    "110,272": 368,
    "281,52": 369,
    "260,291": 370,
    "70,67": 371,
    "49,283": 372,
    "272,79": 373,
    "369,328": 374,
    "289,271": 375,
    "83,271": 376,
    "364,284": 377,
    "322,256": 378,
    "270,261": 379,
    "377,374": 380,
    "282,110": 381,
    "78,272": 382,
    "298,275": 383,
    "265,287": 384,
    "40,275": 385,
    "273,314": 386,
    "265,268": 387,
    "324,269": 388,
    "380,346": 389,
    "283,261": 390,
    "99,276": 391,
    "276,257": 392,
    "49,78": 393,
    "329,256": 394,
    "99,54": 395,
    "52,296": 396,
    "317,271": 397,
    "275,280": 398,
    "281,53": 399,
    "260,67": 400,
    "259,78": 401,
    "302,67": 402,
    "304,256": 403,
    "267,323": 404,
    "289,326": 405,
    "41,300": 406,
    "279,49": 407,
    "279,276": 408,
    "259,303": 409,
    "278,281": 410,
    "53,277": 411,
    "40,287": 412,
    "110,51": 413,
    "78,257": 414,
    "272,312": 415,
    "260,273": 416,
    "314,256": 417,
    "51,366": 418,
    "54,406": 419,
    "341,256": 420,
    "389,345": 421,
    "258,257": 422,
    "99,115": 423,
    "270,256": 424,
    "286,276": 425,
    "260,296": 426,
    "40,284": 427,
    "290,295": 428,
    "269,295": 429,
    "52,257": 430,
    "271,266": 431,
    "49,299": 432,
    "280,302": 433,
    "334,386": 434,
    "399,328": 435,
    "49,287": 436,
    "278,294": 437,
    "279,294": 438,
    "260,261": 439,
    "265,110": 440,
    "434,435": 441,
    "298,284": 442,
    "259,350": 443,
    "278,297": 444,
    "49,342": 445,
    "441,411": 446,
    "51,283": 447,
    "317,326": 448,
    "336,50": 449,
    "267,273": 450,
    "267,307": 451,
    "269,265": 452,
    "446,404": 453,
    "344,41": 454,
    "292,78": 455,
    "332,271": 456,
    "349,293": 457,
    "353,367": 458,
    "320,258": 459,
    "344,277": 460,
    "433,275": 461,
    "47,67": 462,
    "271,289": 463,
    "269,280": 464,
    "339,339": 465,
    "110,267": 466,
    "256,50": 467,
    "290,273": 468,
    "362,348": 469,
    "311,41": 470,
    "405,79": 471,
    "288,110": 472,
    "303,286": 473,
    "267,291": 474,
    "108,296": 475,
    "35,67": 476,
    "273,267": 477,
    "53,41": 478,
    "337,273": 479,
    "52,306": 480,
    "256,258": 481,
    "269,259": 482,
    "368,338": 483,
    "271,268": 484,
    "260,307": 485,
    "331,483": 486,
    "278,49": 487,
    "279,50": 488,
    "256,294": 489,
    "99,55": 490,
    "278,259": 491,
    "295,284": 492,
    "313,296": 493,
    "108,277": 494,
    "278,40": 495,
    "282,287": 496,
    "278,333": 497,
    "256,49": 498,
    "278,286": 499,
    "53,306": 500,
    "79,61": 501,
    "417,288": 502,
    "343,49": 503,
    "353,268": 504,
    "260,306": 505,
    "486,383": 506,
    "78,300": 507,
    "396,260": 508,
    "376,271": 509,
    "278,272": 510,
    "455,390": 511
  }
}